{
    "intents": [
      {
        "tag": "welcome",
        "patterns": ["oi", "bom dia", "boa tarde", "boa noite", "good morning", "hi", "hello", "olá"],
        "responses": ["Olá, eu sou Scrummy, sua assistente em assuntos relacionados a Scrum, no que posso te ajudar?", "Oi, tudo bem? Posso te ajudar?"],
        "context": [""]
      },
      {
        "tag": "who_are_you",
        "patterns": ["qual seu nome?", "quem é você?", "como você chama?", "nome?", "vc é quem"],
        "responses": ["Eu sou uma assistente virtual criada por um grupo de estudantes da PUC-Minas, denominada de Scrummy."],
        "context": [""]
      },
      {
        "tag": "daily",
        "patterns": ["o que é uma daily", "daily", "reunião diária"],
        "responses": ["A daily é uma reunião diária que consiste em cada desenvolvedor apresentar rapidamente o que está fazendo, o que irá fazer no resto do dia e principais dificuldades para a resolução de sua tarefa. A daily possui em média 15 minutos de duração."],
        "context": [""]
      },
      {
        "tag": "sprint",
        "patterns": ["o que é uma sprint", "sprint", "tarefas em determinado periodo"],
        "responses": ["A sprint é o conjunto de tarefas que serão entregues dentro de um certo período de tempo, normalmente 15 dias."],
        "context": [""]
      },
      {
        "tag": "planning",
        "patterns": ["o que é uma planning", "o que é uma reunião de planejamento", "planning", "planejamento", "reunião de planejamento"],
        "responses": ["A planning é uma reunião de final ou começo de sprint que consiste em reunir todos os desenvolvedores e gerentes de produto para que seja planejado tudo que será feito na sprint a seguir. Nesta reunião, serão definidas as complexidades de cada tarefa e serão designadas ao desenvolvedor que irá realizá-la"],
        "context": [""]
      },
      {
        "tag": "review",
        "patterns": ["o que é uma review", "o que é uma revisão de sprint", "review", "revisão", "reunião de revisar"],
        "responses": ["A review é a reunião que ocorre no final ou começo de sprint com o intuito de analisar as tarefas entregues na sprint e verificar quais tarefas planejadas não foram entregues. Além disso, essa reunião tem o intuito de demonstrar o funcionamento das novas funcionalidades/funcionalidades que foram corrigidas para a equipe e possivelmente o cliente final e também analisar com a equipe de desenvolvimento o que ocorreu para que as tarefas planejadas não serem entregues e formas de mitigar o ocorrido"],
        "context": [""]
      },
      {
        "tag": "anything_else",
        "patterns": [],
        "responses": ["Desculpa, não entendi o que você falou, tente novamente!"],
        "context": [""]
      }
    ]
  }